Repository: zevweiss/grep
Catalog: po/*.po
Languages: af

source: Memory exhausted
af: Geheue uitgeput

source: Unbalanced [
af: Ongebalanseerde [

source: Unfinished \ escape
af: Onbeëindigde \-ontsnapstring

source: unfinished repeat count
af: onbeëindigde herhaaltelling

source: malformed repeat count
af: wangevormde herhaaltelling

source: Unbalanced (
af: Ongebalanseerde (

source: No syntax specified
af: Geen sintaks gespesifiseer

source: Unbalanced )
af: Ongebalanseerde )

source: out of memory
af: te min geheue

source: memory exhausted
af: geheue uitgeput

source: invalid context length argument
af: ongeldige konteks-lengte-parameter

source: input is too large to count
af: toevoer is te veel om te tel

source: writing output
af: afvoer word geskryf

source: Binary file %s matches
af: Binêre lêer %s pas

source: (standard input)
af: (standaardtoevoer)

source: warning: %s: %s
af: waarskuwing: %s: %s

source: recursive directory loop
af: rekursiewe lus van gidsinskrywings

source: Usage: %s [OPTION]... PATTERN [FILE]...
af: Gebruik so: %s [OPSIE]... PATROON [LÊER]...

source: Try `%s --help' for more information.
af: Probeer `%s --help' vir meer inligting.

source: Usage: %s [OPTION]... PATTERN [FILE] ...
af: Gebruik so: %s [OPSIE]... PATROON [LÊER] ...

source: Search for PATTERN in each FILE or standard input. Example: %s -i 'hello world' menu.h main.c Regexp selection and interpretation:
af: Soek vir PATROON in elke LÊER of in standaardtoevoer. Voorbeeld: %s -i 'hello world' menu.h main.c Reëlmatige uitdrukking-seleksie en -interpretasie:

source: -E, --extended-regexp PATTERN is an extended regular expression -F, --fixed-strings PATTERN is a set of newline-separated strings -G, --basic-regexp PATTERN is a basic regular expression -P, --perl-regexp PATTERN is a Perl regular expression
af: -E, --extended-regexp PATROON is 'n uitgebreide reëlmatige uitdrukking -F, --fixed-strings PATROON is 'n reeks stringe geskei met nuwereëlkarakters -G, --basic-regexp PATROON is 'n basic regular expression -P, --perl-regexp PATROON is 'n Perl regular expression

source: -e, --regexp=PATTERN use PATTERN as a regular expression -f, --file=FILE obtain PATTERN from FILE -i, --ignore-case ignore case distinctions -w, --word-regexp force PATTERN to match only whole words -x, --line-regexp force PATTERN to match only whole lines -z, --null-data a data line ends in 0 byte, not newline
af: -e, --regexp=PATROON gebruik PATROON as 'n reëlmatige uitdrukking -f, --file=FILE verkry PATROON vanaf LÊER -i, --ignore-case ignoreer kasverskille -w, --word-regexp dwing PATROON om slegs op hele woorde te pas -x, --line-regexp dwing PATROON om slegs op hele reëls te pas -z, --null-data elke datareël eindig met 'n 0-greep, nie 'n nuwereëlkarakter nie

source: Miscellaneous: -s, --no-messages suppress error messages -v, --invert-match select non-matching lines -V, --version print version information and exit --help display this help and exit --mmap use memory-mapped input if possible
af: Verskeie: -s, --no-messages onderdruk foutboodskappe -v, --invert-match soek nie-passende reëls -V, --version wys weergaweinligting en stop --help wys hierdie hulpboodskap en stop --mmap gebruik geheue-gebonde toevoer indien moontlik

source: Output control: -m, --max-count=NUM stop after NUM matches -b, --byte-offset print the byte offset with output lines -n, --line-number print line number with output lines --line-buffered flush output on every line -H, --with-filename print the filename for each match -h, --no-filename suppress the prefixing filename on output --label=LABEL print LABEL as filename for standard input -o, --only-matching show only the part of a line matching PATTERN -q, --quiet, --silent suppress all normal output --binary-files=TYPE assume that binary files are TYPE TYPE is 'binary', 'text', or 'without-match' -a, --text equivalent to --binary-files=text -I equivalent to --binary-files=without-match -d, --directories=ACTION how to handle directories ACTION is 'read', 'recurse', or 'skip' -D, --devices=ACTION how to handle devices, FIFOs and sockets ACTION is 'read' or 'skip' -R, -r, --recursive equivalent to --directories=recurse --include=PATTERN files that match PATTERN will be examined --exclude=PATTERN files that match PATTERN will be skipped. --exclude-from=FILE files that match PATTERN in FILE will be skipped. -L, --files-without-match only print FILE names containing no match -l, --files-with-matches only print FILE names containing matches -c, --count only print a count of matching lines per FILE -Z, --null print 0 byte after FILE name
af: Afvoerbeheer: -m, --max-count=AANTAL stop na AANTAL passings -b, --byte-offset wys die greep-uitwyking saam met elke afvoerreël -n, --line-number wys die reëlnommer saam met elke afvoerreël --line-buffered maak elke keer die lynbuffer leeg -H, --with-filename wys die lêernaam vir elke passing -h, --no-filename onderdruk die vooraf-lêernaam in die afvoer --label=ETIKET wys ETIKET as lêernaam vir standaardtoevoer -o, --only-matching wys slegs die deel van 'n reël wat pas op die PATROON -q, --quiet, --silent onderdruk alle normale afvoer --binary-files=TIPE aanvaar dat binêre lêers van hierdie TIPE is. TIPE kan wees: 'binary', 'text', of 'without-match' -a, --text dieselfde as --binary-files=text -I dieselfde as --binary-files=without-match -d, --directories=AKSIE hoe om gidse te hanteer AKSIE kan wees: 'read', 'recurse', of 'skip' -D, --devices=AKSIE hoe om toestelle te hanteer, FIFOs en sokke AKSIE kan wees: 'read' of 'skip' -R, -r, --recursive dieselfde as --directories=recurse --include=PATROON lêers waarop PATROON pas sal ondersoek word. --exclude=PATROON lêers waarop PATROON pas sal sal oorgeslaan word. --exclude-from=FILE lêers waarop PATROON in LÊER pas sal oorgeslaan word. -L, --files-without-match wys slegs lêername wat geen passing bevat nie -l, --files-with-matches wys slegs lêername wat wel passing(s) bevat -c, --count wys slegs die aantal reëls in elke LÊER wat passings bevat -Z, --null wys die 0-greep na die LÊERnaam

source: Context control: -B, --before-context=NUM print NUM lines of leading context -A, --after-context=NUM print NUM lines of trailing context -C, --context=NUM print NUM lines of output context -NUM same as --context=NUM --color[=WHEN], --colour[=WHEN] use markers to distinguish the matching string WHEN may be `always', `never' or `auto'. -U, --binary do not strip CR characters at EOL (MSDOS) -u, --unix-byte-offsets report offsets as if CRs were not there (MSDOS) `egrep' means `grep -E'. `fgrep' means `grep -F'. With no FILE, or when FILE is -, read standard input. If less than two FILEs given, assume -h. Exit status is 0 if match, 1 if no match, and 2 if trouble.
af: Konteksbeheer: -B, --before-context=AANTAL wys AANTAL reëls voorafgaande konteks -A, --after-context=AANTAL wys AANTAL reëls daaropvolgende konteks -C, --context=AANTAL wys AANTAL reëls afvoerkonteks -AANTAL dieselfde as --context=AANTAL --color[=WHEN], --colour[=WHEN] gebruik merkers om die passende string uit te wys WHEN kan wees: `always', `never' of `auto'. -U, --binary moenie CR-karakters by reëleindes wegvat nie (MSDOS) -u, --unix-byte-offsets wys uitwyking asof die CR nie daar is nie (MSDOS) `egrep' beteken `grep -E'. `fgrep' beteken `grep -F'. Met geen LÊER, of wanneer LÊER 'n - is, lees standaardtoevoer. Indien minder as twee LÊERs gegee is, aanvaar -h. Uittreestatus is 0 vir passing, 1 vir geen passing, en 2 vir probleemgevalle.

source: conflicting matchers specified
af: teenstrydige passers is gespesifiseer

source: unknown devices method
af: onbekende metode vir toestelle

source: unknown directories method
af: onbekende metode vir gidse

source: invalid max count
af: ongeldige maks-telling

source: unknown binary-files type
af: onbekende binêre-lêertipe

source: This is free software; see the source for copying conditions. There is NO warranty; not even for MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.
af: Hierdie is vry programmatuur; kyk in die bronkode vir kopieërvoorwaardes. Daar is GEEN waarborg nie; selfs nie vir VERKOOPBAARHEID of GESKIKTHEID VIR 'N SPESIFIEKE DOEL nie.

source: The -P option is not supported
af: Die -P opsie word nie ondersteun nie

source: The -P and -z options cannot be combined
af: Die -P en -z opsies kan nie gekombineer word nie

source: Unknown system error
af: Onbekende stelselfout

source: %s: option `%s' is ambiguous
af: %s: opsie `%s' is dubbelsinnig

source: %s: option `--%s' doesn't allow an argument
af: %s: opsie `--%s' laat nie 'n parameter toe nie

source: %s: option `%c%s' doesn't allow an argument
af: %s: opsie `%c%s' laat nie 'n parameter toe nie

source: %s: option `%s' requires an argument
af: %s: opsie `%s' benodig 'n parameter

source: %s: unrecognized option `--%s'
af: %s: onbekende opsie `--%s'

source: %s: unrecognized option `%c%s'
af: %s: onbekende opsie `%c%s'

source: %s: illegal option -- %c
af: %s: ongeldige opsie -- %c

source: %s: invalid option -- %c
af: %s: ongeldige opsie -- %c

source: %s: option requires an argument -- %c
af: %s: opsie benodig 'n parameter -- %c

source: %s: option `-W %s' is ambiguous
af: %s: opsie `-W %s' is dubbelsinnig

source: %s: option `-W %s' doesn't allow an argument
af: %s: opsie `-W %s' laat nie 'n parameter toe nie
